KevinZhoutianyi/STM32F401_Group33/LL/MYLIB/inc/Motors_And_Encoders.h
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_adc.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_crc.h"
#include "stm32f4xx_ll_dac.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_dma2d.h"
#include "stm32f4xx_ll_i2c.h"
#include "stm32f4xx_ll_iwdg.h"
#include "stm32f4xx_ll_rtc.h"
#include "stm32f4xx_ll_spi.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_usart.h"
#include "stm32f4xx_ll_wwdg.h"
#include "stm32f4xx_ll_rng.h"
#include "stm32f4xx_ll_lptim.h"
#include <stdbool.h>

void Configure_Encoder_Left(void);
int Get_Encoder_Left(void);
void Configure_Motor_Left(void);
void Set_DutyCycle_Motor_Left(float D);


void Configure_Encoder_Right(void);
int Get_Encoder_Right(void);
void Configure_Motor_Right(void);
void Set_DutyCycle_Motor_Right(float D);
void Start(void);
void Reset_Encoders(void);
uint32_t getPulsesLeft(void);
uint32_t getPulsesRight(void);


